vialabs-tec/viaaccess-bridge/install/qr-reader-firmware/sdkconfig.defaults
# Target: ESP32-S3 N16R8 (16 MB flash, 8 MB octal PSRAM).
CONFIG_IDF_TARGET="esp32s3"

# Flash layout. DIO and not QIO: octal PSRAM below takes over the same data lines
# the quad flash modes would need, so asking for QIO here is silently downgraded.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Encrypt the default NVS partition (device key, Wi-Fi password, Wi-Fi stack
# credentials). HMAC derives XTS keys from an eFuse block at runtime, so no
# nvs_keys partition and no full flash encryption are required.
CONFIG_NVS_ENCRYPTION=y
CONFIG_NVS_SEC_KEY_PROTECT_USING_HMAC=y
CONFIG_NVS_SEC_HMAC_EFUSE_KEY_ID=0

# Octal PSRAM. This is what makes GPIO 33-37 unavailable on this module, so the
# factory pin map in viaaccess/config.hpp stays in the low bank.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# The clock service asks DHCP for an NTP server before falling back to
# pool.ntp.org, which is what works on a LAN that blocks outbound NTP. Without
# this option esp_netif_sntp_init rejects the whole configuration and the
# appliance never gets a clock, so TLS to Identity fails on certificate dates.
CONFIG_LWIP_DHCP_GET_NTP_SRV=y

# TLS to Identity uses the bundled CA roots; the appliance ships no pinned cert.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# Dynamic QR URLs carry a JWT, so both the local server and the client need
# headroom above the stock limits.
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=1024
CONFIG_HTTPD_ERR_RESP_NO_DELAY=y

# The Pi got these from harden-os.sh; on the S3 they are firmware settings.
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_INT_WDT=y
CONFIG_ESP_BROWNOUT_DET=y
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_7=y

# Keep the previous slot bootable until the new image confirms itself.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000
CONFIG_LWIP_LOCAL_HOSTNAME="viaaccess-qr"

# NimBLE for Apple iBeacon advertising (Identity bleBeacon / member proximity).
# Broadcaster-only: the appliance does not scan or act as a GATT central.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
